Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2025dar176.h
#define _CNNED_CNNED13_POSITION                  0x0000000D
#define _CNNED_CNNED13_MASK                      0x00002000
#define _CNNED_CNNED13_LENGTH                    0x00000001

#define _CNNED_CNNED14_POSITION                  0x0000000E
#define _CNNED_CNNED14_MASK                      0x00004000
#define _CNNED_CNNED14_LENGTH                    0x00000001

#define _CNNED_CNNED15_POSITION                  0x0000000F
#define _CNNED_CNNED15_MASK                      0x00008000
#define _CNNED_CNNED15_LENGTH                    0x00000001

#define _CNFD_CNFD0_POSITION                     0x00000000
#define _CNFD_CNFD0_MASK                         0x00000001
#define _CNFD_CNFD0_LENGTH                       0x00000001

#define _CNFD_CNFD1_POSITION                     0x00000001
#define _CNFD_CNFD1_MASK                         0x00000002
#define _CNFD_CNFD1_LENGTH                       0x00000001

#define _CNFD_CNFD2_POSITION                     0x00000002
#define _CNFD_CNFD2_MASK                         0x00000004
#define _CNFD_CNFD2_LENGTH                       0x00000001

#define _CNFD_CNFD3_POSITION                     0x00000003
#define _CNFD_CNFD3_MASK                         0x00000008
#define _CNFD_CNFD3_LENGTH                       0x00000001

#define _CNFD_CNFD4_POSITION                     0x00000004
#define _CNFD_CNFD4_MASK                         0x00000010
#define _CNFD_CNFD4_LENGTH                       0x00000001

#define _CNFD_CNFD5_POSITION                     0x00000005
#define _CNFD_CNFD5_MASK                         0x00000020
#define _CNFD_CNFD5_LENGTH                       0x00000001

#define _CNFD_CNFD6_POSITION                     0x00000006
#define _CNFD_CNFD6_MASK                         0x00000040
#define _CNFD_CNFD6_LENGTH                       0x00000001

#define _CNFD_CNFD7_POSITION                     0x00000007
#define _CNFD_CNFD7_MASK                         0x00000080
#define _CNFD_CNFD7_LENGTH                       0x00000001

#define _CNFD_CNFD9_POSITION                     0x00000009
#define _CNFD_CNFD9_MASK                         0x00000200
#define _CNFD_CNFD9_LENGTH                       0x00000001

#define _CNFD_CNFD10_POSITION                    0x0000000A
#define _CNFD_CNFD10_MASK                        0x00000400
#define _CNFD_CNFD10_LENGTH                      0x00000001

#define _CNFD_CNFD11_POSITION                    0x0000000B
#define _CNFD_CNFD11_MASK                        0x00000800
#define _CNFD_CNFD11_LENGTH                      0x00000001

#define _CNFD_CNFD12_POSITION                    0x0000000C
#define _CNFD_CNFD12_MASK                        0x00001000
#define _CNFD_CNFD12_LENGTH                      0x00000001

#define _CNFD_CNFD13_POSITION                    0x0000000D
#define _CNFD_CNFD13_MASK                        0x00002000
#define _CNFD_CNFD13_LENGTH                      0x00000001

#define _CNFD_CNFD14_POSITION                    0x0000000E
#define _CNFD_CNFD14_MASK                        0x00004000
#define _CNFD_CNFD14_LENGTH                      0x00000001

#define _CNFD_CNFD15_POSITION                    0x0000000F
#define _CNFD_CNFD15_MASK                        0x00008000
#define _CNFD_CNFD15_LENGTH                      0x00000001

#define _SRCON0D_SR0D0_POSITION                  0x00000000
#define _SRCON0D_SR0D0_MASK                      0x00000001
#define _SRCON0D_SR0D0_LENGTH                    0x00000001

#define _SRCON0D_SR0D1_POSITION                  0x00000001
#define _SRCON0D_SR0D1_MASK                      0x00000002
#define _SRCON0D_SR0D1_LENGTH                    0x00000001

#define _SRCON0D_SR0D2_POSITION                  0x00000002
#define _SRCON0D_SR0D2_MASK                      0x00000004
#define _SRCON0D_SR0D2_LENGTH                    0x00000001

#define _SRCON0D_SR0D3_POSITION                  0x00000003
#define _SRCON0D_SR0D3_MASK                      0x00000008
#define _SRCON0D_SR0D3_LENGTH                    0x00000001

#define _SRCON0D_SR0D4_POSITION                  0x00000004
#define _SRCON0D_SR0D4_MASK                      0x00000010
#define _SRCON0D_SR0D4_LENGTH                    0x00000001

#define _SRCON0D_SR0D5_POSITION                  0x00000005
#define _SRCON0D_SR0D5_MASK                      0x00000020
#define _SRCON0D_SR0D5_LENGTH                    0x00000001

#define _SRCON0D_SR0D6_POSITION                  0x00000006
#define _SRCON0D_SR0D6_MASK                      0x00000040
#define _SRCON0D_SR0D6_LENGTH                    0x00000001

#define _SRCON0D_SR0D7_POSITION                  0x00000007
#define _SRCON0D_SR0D7_MASK                      0x00000080
#define _SRCON0D_SR0D7_LENGTH                    0x00000001

#define _SRCON0D_SR0D9_POSITION                  0x00000009
#define _SRCON0D_SR0D9_MASK                      0x00000200
#define _SRCON0D_SR0D9_LENGTH                    0x00000001

#define _SRCON0D_SR0D10_POSITION                 0x0000000A
#define _SRCON0D_SR0D10_MASK                     0x00000400
#define _SRCON0D_SR0D10_LENGTH                   0x00000001

#define _SRCON0D_SR0D11_POSITION                 0x0000000B
#define _SRCON0D_SR0D11_MASK                     0x00000800
#define _SRCON0D_SR0D11_LENGTH                   0x00000001

#define _SRCON0D_SR0D12_POSITION                 0x0000000C
#define _SRCON0D_SR0D12_MASK                     0x00001000
#define _SRCON0D_SR0D12_LENGTH                   0x00000001

#define _SRCON0D_SR0D13_POSITION                 0x0000000D
#define _SRCON0D_SR0D13_MASK                     0x00002000
#define _SRCON0D_SR0D13_LENGTH                   0x00000001

#define _SRCON0D_SR0D14_POSITION                 0x0000000E
#define _SRCON0D_SR0D14_MASK                     0x00004000
#define _SRCON0D_SR0D14_LENGTH                   0x00000001

#define _SRCON0D_SR0D15_POSITION                 0x0000000F
#define _SRCON0D_SR0D15_MASK                     0x00008000
#define _SRCON0D_SR0D15_LENGTH                   0x00000001

#define _SRCON1D_SR1D0_POSITION                  0x00000000
#define _SRCON1D_SR1D0_MASK                      0x00000001
#define _SRCON1D_SR1D0_LENGTH                    0x00000001

#define _SRCON1D_SR1D1_POSITION                  0x00000001
#define _SRCON1D_SR1D1_MASK                      0x00000002
#define _SRCON1D_SR1D1_LENGTH                    0x00000001

#define _SRCON1D_SR1D2_POSITION                  0x00000002
#define _SRCON1D_SR1D2_MASK                      0x00000004
#define _SRCON1D_SR1D2_LENGTH                    0x00000001

#define _SRCON1D_SR1D3_POSITION                  0x00000003
#define _SRCON1D_SR1D3_MASK                      0x00000008
#define _SRCON1D_SR1D3_LENGTH                    0x00000001

#define _SRCON1D_SR1D4_POSITION                  0x00000004
#define _SRCON1D_SR1D4_MASK                      0x00000010
#define _SRCON1D_SR1D4_LENGTH                    0x00000001

#define _SRCON1D_SR1D5_POSITION                  0x00000005
#define _SRCON1D_SR1D5_MASK                      0x00000020
#define _SRCON1D_SR1D5_LENGTH                    0x00000001

