Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/include/proc/p32mz2025dar176.h
#define _USBE2RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE2RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE2RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE3TXA_TXFADDR_POSITION               0x00000000
#define _USBE3TXA_TXFADDR_MASK                   0x0000007F
#define _USBE3TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE3TXA_TXHUBADD_POSITION              0x00000010
#define _USBE3TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE3TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE3TXA_MULTTRAN_POSITION              0x00000017
#define _USBE3TXA_MULTTRAN_MASK                  0x00800000
#define _USBE3TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE3TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE3TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE3TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE3RXA_RXFADDR_POSITION               0x00000000
#define _USBE3RXA_RXFADDR_MASK                   0x0000007F
#define _USBE3RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE3RXA_RXHUBADD_POSITION              0x00000010
#define _USBE3RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE3RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE3RXA_MULTTRAN_POSITION              0x00000017
#define _USBE3RXA_MULTTRAN_MASK                  0x00800000
#define _USBE3RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE3RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE3RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE3RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE4TXA_TXFADDR_POSITION               0x00000000
#define _USBE4TXA_TXFADDR_MASK                   0x0000007F
#define _USBE4TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE4TXA_TXHUBADD_POSITION              0x00000010
#define _USBE4TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE4TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE4TXA_MULTTRAN_POSITION              0x00000017
#define _USBE4TXA_MULTTRAN_MASK                  0x00800000
#define _USBE4TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE4TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE4TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE4TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE4RXA_RXFADDR_POSITION               0x00000000
#define _USBE4RXA_RXFADDR_MASK                   0x0000007F
#define _USBE4RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE4RXA_RXHUBADD_POSITION              0x00000010
#define _USBE4RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE4RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE4RXA_MULTTRAN_POSITION              0x00000017
#define _USBE4RXA_MULTTRAN_MASK                  0x00800000
#define _USBE4RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE4RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE4RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE4RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE5TXA_TXFADDR_POSITION               0x00000000
#define _USBE5TXA_TXFADDR_MASK                   0x0000007F
#define _USBE5TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE5TXA_TXHUBADD_POSITION              0x00000010
#define _USBE5TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE5TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE5TXA_MULTTRAN_POSITION              0x00000017
#define _USBE5TXA_MULTTRAN_MASK                  0x00800000
#define _USBE5TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE5TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE5TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE5TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE5RXA_RXFADDR_POSITION               0x00000000
#define _USBE5RXA_RXFADDR_MASK                   0x0000007F
#define _USBE5RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE5RXA_RXHUBADD_POSITION              0x00000010
#define _USBE5RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE5RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE5RXA_MULTTRAN_POSITION              0x00000017
#define _USBE5RXA_MULTTRAN_MASK                  0x00800000
#define _USBE5RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE5RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE5RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE5RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE6TXA_TXFADDR_POSITION               0x00000000
#define _USBE6TXA_TXFADDR_MASK                   0x0000007F
#define _USBE6TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE6TXA_TXHUBADD_POSITION              0x00000010
#define _USBE6TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE6TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE6TXA_MULTTRAN_POSITION              0x00000017
#define _USBE6TXA_MULTTRAN_MASK                  0x00800000
#define _USBE6TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE6TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE6TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE6TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE6RXA_RXFADDR_POSITION               0x00000000
#define _USBE6RXA_RXFADDR_MASK                   0x0000007F
#define _USBE6RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE6RXA_RXHUBADD_POSITION              0x00000010
#define _USBE6RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE6RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE6RXA_MULTTRAN_POSITION              0x00000017
#define _USBE6RXA_MULTTRAN_MASK                  0x00800000
#define _USBE6RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE6RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE6RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE6RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE7TXA_TXFADDR_POSITION               0x00000000
#define _USBE7TXA_TXFADDR_MASK                   0x0000007F
#define _USBE7TXA_TXFADDR_LENGTH                 0x00000007

#define _USBE7TXA_TXHUBADD_POSITION              0x00000010
#define _USBE7TXA_TXHUBADD_MASK                  0x007F0000
#define _USBE7TXA_TXHUBADD_LENGTH                0x00000007

#define _USBE7TXA_MULTTRAN_POSITION              0x00000017
#define _USBE7TXA_MULTTRAN_MASK                  0x00800000
#define _USBE7TXA_MULTTRAN_LENGTH                0x00000001

#define _USBE7TXA_TXHUBPRT_POSITION              0x00000018
#define _USBE7TXA_TXHUBPRT_MASK                  0x7F000000
#define _USBE7TXA_TXHUBPRT_LENGTH                0x00000007

#define _USBE7RXA_RXFADDR_POSITION               0x00000000
#define _USBE7RXA_RXFADDR_MASK                   0x0000007F
#define _USBE7RXA_RXFADDR_LENGTH                 0x00000007

#define _USBE7RXA_RXHUBADD_POSITION              0x00000010
#define _USBE7RXA_RXHUBADD_MASK                  0x007F0000
#define _USBE7RXA_RXHUBADD_LENGTH                0x00000007

#define _USBE7RXA_MULTTRAN_POSITION              0x00000017
#define _USBE7RXA_MULTTRAN_MASK                  0x00800000
#define _USBE7RXA_MULTTRAN_LENGTH                0x00000001

#define _USBE7RXA_RXHUBPRT_POSITION              0x00000018
#define _USBE7RXA_RXHUBPRT_MASK                  0x7F000000
#define _USBE7RXA_RXHUBPRT_LENGTH                0x00000007

#define _USBE0CSR0_TXMAXP_POSITION               0x00000000
#define _USBE0CSR0_TXMAXP_MASK                   0x000007FF
#define _USBE0CSR0_TXMAXP_LENGTH                 0x0000000B

#define _USBE0CSR0_RXRDY_POSITION                0x00000010
#define _USBE0CSR0_RXRDY_MASK                    0x00010000
#define _USBE0CSR0_RXRDY_LENGTH                  0x00000001

